app/Http/Controllers/Owner/ProductController.php

select * from `owners` where `id` = 1 and `owners`.`deleted_at` is null
select * from `products` where `products`.`shop_id` in (1)
select * from `shops` where `shops`.`owner_id` in (1)
---
    public function __construct()
    {
        $this->middleware('auth:owners');

        $this->middleware(function($request, $next){
            $id = $request->route()->parameter('product');
            if(!is_null($id)){
            $productsOwnerId = Product::findOrFail($id)->shop->owner->id;
            $productId = (int)$productsOwnerId;
            if($productId !== Auth::id()){
            abort(404);
            }
            }
            return $next($request);
            });

select * from `images` where `images`.`id` in (1, 2, 3)
---
    public function index()
    {
    //    $products = Owner::findOrFail(Auth::id())->shop->product;

        $ownerInfo = Owner::with('shop.product.imageFirst')
        ->where('id', Auth::id())->get();

select `id`, `name` from `shops` where `owner_id` = 1
select * from `primary_categories`
---
    public function create()
    {
        $shops = Shop::where('owner_id', Auth::id())
        ->select('id', 'name')
        ->get();

        $images = Image::where('owner_id', Auth::id())
        ->select('id','title','filename')
        ->orderBy('updated_at', 'desc')
        ->get();

        $categories = PrimaryCategory::with('secondary')
        ->get();