app/Http/Controllers/Owner/ShopController.php

        public function index()
        {
            // $ownerId = Auth::id();
            // phpinfo();
            $shops = Shop::where('owner_id', Auth::id())->get();
---
select * from `shops` where `owner_id` = 1